backend/controllers/ProductosController.php

    public function actionCreate()
    {
        $model = new Productos();

        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
                $model->imagen = UploadedFile::getInstance($model, 'imagen');

                if($model->validate()){
                    $model->imagen->saveAs('uploads/' . $model->imagen->baseName . '.' . $model->imagen->extension);
                }else{
                    return var_dump($model->errors);
                }

                $model->save();
---
INSERT INTO `productos` (`nombre`, `marca`, `precio`, `descripcion`, `imagen`) VALUES ('Macbook pro 16gb ram 2022', 'Apple', '2313.122', 'Macbook pro 2022 like new', '632c66b0f576c60018fc3421.webp')

    protected function findModel($id)
    {
        if (($model = Productos::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `productos` WHERE `id`='5'