frontend/controllers/SiteController.php

SELECT * FROM `productos`
---
    public function actionProductos(){
        // $data
        $data = Productos::find()->all();