backend/models/BackendUser.php

    public static function findByUsername($username){
        $result = self::find()
        ->where(['username' => $username])
        ->one();
---
SELECT * FROM `backend_user` WHERE `username`='joel'